%  Imitation

%  Иммитационное моделирование дискретной детерминированной динамической системы U
%  с помощью системы А, т.е. подбор такой системы Z, управляющей системой А, что A 
%  ведет себя как U (точнее, как можно ближе к U).
%    inf{||A*Z-U||: \forall Z} => Z^{*}=A^{+}U

clear all; close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

disp(' ');
disp(' Иммитационное моделирование дискретной детерминированной ');
disp(' динамической системы U с помощью иммитирующей системы А,');
disp(' управляемой системой Z.');disp(' ');
disp(' Задача сводится к решению матричного уравнения AZ=U');
disp(' методом МПМ (гл.5, \S1, п.2).');
disp(' ');

N=31;C=1.1;
x=linspace(0,1,N)';sigma=0.3;sigma1=0.02;sigma2=0.05;
%  Передаточная функция (матрица) системы А
K=(x).*exp(-((x)/sigma).^2);
A=tril(toeplitz(K',K));
%  Модельная передаточная функция системы Z
K1=(x.^2).*exp(-(x/sigma2));
Z=tril(toeplitz(K1',K1));Z=pinv(A)*A*Z;
%  Модельное передаточная функция системы U
U=A*Z;

% Возмущения данных
H=0.01;delta=0.001;

disp('               Информация о возмущении данных задачи:');
disp(['   Относит. ошибка возмущения передаточной функции для системы А = ' num2str(H)]);
disp(['   Относит. ошибка возмущения передаточной функции для системы U = ' num2str(delta)]);
disp(' ');

RA=tril(randn(size(A)));A1=A+H*norm(A)*(RA)/norm(RA);
RN1=randn(size(U));U1=U+delta*norm(U)*RN1/norm(RN1);
AA=A1'*A1;UU=A1'*U1;

%  Метод МПМ
hh=(C*H*norm(AA))^2;
[B,IB,rapr]=mpm_inv1(AA,hh);
%  Вычисленная передаточная функция управляющей системы Z и соответствующее 
%  передаточная функция системы A*Z, иммитирующей U

KK=IB*UU;K2=KK(:,1);ZA=tril(toeplitz(K2,K2'));UA=A*ZA;

figure(2);subplot(1,3,1);plot(x,A(:,1),'r');xlabel('t');ylabel('A')
set(gca,'FontName',FntNm,'FontSize',8);
title(' Передаточная функция А')
subplot(1,3,2);plot(x,Z(:,1),'c',x,ZA(:,1),'k.-');xlabel('t');ylabel('Z, Z_{appr} = A^{+}U')
set(gca,'FontName',FntNm,'FontSize',8);title(' Передаточные функции Z, Z_{appr}')
legend('Z','Z_{appr} = A^{+}U',1)
subplot(1,3,3);plot(x,U(:,1),x,UA(:,1),'o');xlabel('t');ylabel('U, U_{appr} = AA^{+}U')
set(gca,'FontName',FntNm,'FontSize',8);title(' Передаточные функции U, U_{appr}')
legend('U','U_{appr} = AA^{+}U',1)
xlabel('t');


figure(1);plot(x,0.01*A(:,1),'r',x,Z(:,1),'c',x,U(:,1),x,ZA(:,1),'k.-',x,UA(:,1),'o')
set(gca,'FontName',FntNm);title(' Передаточные функции систем')
legend('0.01*A','Z','U','Z_{appr}=A^{+}U','U_{appr}=AA^{+}U',1)
xlabel('t');ylabel('A, U, Z, AZ')

Err=norm(U-UA)/norm(U);
disp('               Информация о результатах иммитации:');
disp(['   Относит. ошибка иммитации передаточной функции для системы U = ' num2str(Err)]);
disp(' ');disp('    См. также более детальную фигуру 2. ');

disp(' ');disp('*************** Конец ***********************************************');
