
%   Tikh_smooth

%  Применение тихоновского алгоритма с регуляризатором -- сглаженной вариацией  
%  (выбором параметра по ОПН) для решения линейных задач с разрывными решениями
%  (с.165).

if ~exist('fmincon');disp(' ');
  disp('  ВНИМАНИЕ! Демонстрация прерывается, т.к. на этой ЭВМ');
  disp('  не установлен компонент МАТЛАБа - Optimization Toolbox.');return;end

clear all;close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
vvv=ver('MATLAB');nmver=str2num(vvv.Version);if nmver>6;
warning('off','MATLAB:dispatcher:InexactMatch');end

%   Задание параметров и задачи
disp(' ');
disp(' Применение тихоновского алгоритма с регуляризатором -- сглаженной вариацией');
disp(' для линейных задач с разрывными решениями (выбор параметра по ОПН) (с.165)');
disp(' ');
disp('-----------------------------------------------------------------------------');
disp(' ');
disp('   Решается уравнение Фредгольма 1 рода с ядром Пуассона.');disp(' ');
disp(' ');disp('    Модельные задачи (решения): 1) z(s)=1+sgn(s); 2) z(s)=sgn(s)(1-|s|)');
          disp('                                3) z(s)=sgn(s)(s^2-1); 4) z(s)=sgn(s-0.5)-2sgn(s+0.5)');
disp(' ');
disp('-----------------------------------------------------------------------------');
disp(' ');
%   Задание параметров и задачи
numm=input(' Введите номер задачи! ');disp(' ');
if isempty(numm);numm=1;disp(['  Решается по умолчанию задача ' num2str(numm)]);
else disp(['  Решается задача ' num2str(numm)]);end

new_er=0;% Выбрать новую реализацию ошибок данных (new_er=1) или стандартнные (new_er=0)? 
%   Задание уровня ошибок данных
delta=0.01;% правая часть уравнения
deltaA=0.0001;% ошибки ядра

[a0,s,h,A,U0,u1,C_min,RU,RA]=mod_prob_norm(numm);

%% Выбрать новую помеху или стандартную?   
if new_er==1;
   RU=randn(size(U0));RA=randn(size(A));
   else end;
NRA=norm(RA);NRU=norm(RU);
U=U0+delta*norm(U0)*RU/NRU;% Приближенная правая часть уравнения
AA=A+deltaA*norm(A)*RA/NRA;% Приближенная матрица задачи
disp(' ');
disp('-----------------------------------------------------------------------------');
disp(' ');
disp(['   Уровни возмущения данных: h = ' num2str(deltaA) ' delta = ' num2str(delta)])
disp(' ');
disp('-----------------------------------------------------------------------------');
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%         Решение задачи
%      Метод регуляризации в W_2^1 и L_2  
% Вычисление основных функций, по которым выбирается параметр:
q=0.5;NN=12;C=1.01;
disp(' ');disp(' Вычисление вспомогательных функций');disp(' ');pause(1)
disp('-----------------------------------------------------------------------------');
tic
[Alf,Opt,Dis,Nz]=func_calc_smooth(AA,U,delta,C,q,NN,a0');

Del=delta*norm(U)+deltaA*norm(AA)*Nz;
% Выбор параметра по ОПН для W_2^1 
ix=min(find(Dis<C*Del));pri=0;
[zm,iz]=min(Opt);
if isempty(ix);ix=iz;pri=1;end

%graf_alf_select(Alf,Dis,Del,ix,delta,pri);
[zrs,dis,gam]=Tikh_inv_smooth(AA,U,Alf(ix));
toc

%Ucalc=AA*zrd;figure(1);plot(s,U,'.',s,Ucalc,'r')
figure(2);plot(s,zrs,'.-',s,a0','r');xlabel('s');ylabel('z(s)')
set(gca,'FontName',FntNm);title(' Решения')
legend('Приближенное','Точное',1)
disp('-----------------------------------------------------------------------------');

Err=norm(zrs-a0')/norm(a0');
disp(' ');
disp(['    Относительная ошибка приближенного решения (по норме L_2) = ' num2str(Err)]);
disp(' ');
disp('-----------------------------------------------------------------------------');
disp('        Конец');