
%   Tikh_discont

%  Применение тихоновского алгоритма в W_2^1 и L_2 (с выбором параметра по ОПН) для
%  регуляризации линейных задач с разрывными решениями

clear all;close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
vvv=ver('MATLAB');nmver=str2num(vvv.Version);if nmver>6;
warning('off','MATLAB:dispatcher:InexactMatch');end

%   Задание параметров и задачи
disp(' ');
disp(' Применение тихоновского алгоритма в W_2^1 и L_2 с выбором параметра по ОПН');
disp(' для регуляризации линейных задач с разрывными решениями (с.164)');
disp(' ');
disp('-----------------------------------------------------------------------------');
disp(' ');
disp('   Решается уравнение Фредгольма 1 рода с ядром Пуассона.');disp(' ');
disp(' ');disp('    Модельные задачи (решения): 1) z(s)=1+sgn(s); 2) z(s)=sgn(s)(1-|s|)');
          disp('                                3) z(s)=sgn(s)(s^2-1); 4) z(s)=sgn(s-0.5)-2sgn(s+0.5)');
disp(' ');
disp('-----------------------------------------------------------------------------');
disp(' ');
%   Задание параметров и задачи
numm=input(' Введите номер задачи! ');
disp(' ');
if isempty(numm);numm=1;disp(['  Решается по умолчанию задача ' num2str(numm)]);
else disp(['  Решается задача ' num2str(numm)]);end

new_er=1;% Выбрать новую реализацию ошибок данных (new_er=1) или стандартнные (new_er=0)? 
%   Задание уровня ошибок данных
delta=0.01;% правая часть уравнения
deltaA=0.0001;% ошибки ядра

[a0,s,h,A,U0,u1,C_min,RU,RA]=mod_prob_norm(numm);

%% Выбрать новую помеху или стандартную?   
if new_er==1;
   RU=randn(size(U0));RA=randn(size(A));
   else end;
NRA=norm(RA);NRU=norm(RU);
U=U0+delta*norm(U0)*RU/NRU;% Приближенная правая часть уравнения
AA=A+deltaA*norm(A)*RA/NRA;% Приближенная матрица задачи

disp('-----------------------------------------------------------------------------');
disp(' ');
disp(['   Уровни возмущения данных: h = ' num2str(deltaA) ' delta = ' num2str(delta)])
disp(' ');
disp('-----------------------------------------------------------------------------');

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%         Решение задачи
%      Метод регуляризации в W_2^1 и L_2  
% Вычисление основных функций, по которым выбирается параметр:
q=0.5;NN=12;C=1.01;
%disp(' ');disp(' Вычисление вспомогательных функций');disp(' ');pause(1)

[Alf,Opt,Dis,Nz,Optl,Disl,Nzl]=func_calc_Tikh(AA,U,h,delta,C,q,NN,a0');

Del=delta*norm(U)+deltaA*norm(AA)*Nz;
% Выбор параметра по ОПН для W_2^1 
ix=min(find(Dis<C*Del));pri=0;
[zm,iz]=min(Opt);
if isempty(ix);ix=iz;pri=1;end

[zrw,disw,gamw,zr0,disl,gaml]=Tikh_inv(AA,U,h,Alf(ix));

% Выбор параметра по ОПН для L_2
Dell=delta*norm(U)+deltaA*norm(AA)*Nzl;
ixl=min(find(Disl<C*Dell));pri=0;
[zm,izl]=min(Optl);
if isempty(ixl);ixl=izl;pri=1;end

[zr0,disw,gamw,zrl,disl,gaml]=Tikh_inv(AA,U,h,Alf(ix));

figure(2);plot(s,zrw,'.-',s,zrl,'ok-',s,a0','r')
set(gca,'FontName',FntNm);
title(' Решения');legend('W_2^2','L_2','Точное',1)

ErrW=norm(zrw-a0')/norm(a0');ErrL=norm(zrl-a0')/norm(a0');

disp(['    Относительная ошибка решения из L_2 (по норме L_2) = ' num2str(ErrL)]);
disp(['    Относительная ошибка решения из W_2^1 (по норме L_2) = ' num2str(ErrW)]);
disp(' ');
disp('-----------------------------------------------------------------------------');

disp('        Конец');