%  Main_OPN_OPSF

% Решение интегральных уравнений 1-го рода с помощью алгоритмов ОПН и ОПСФ 
%  (модуль gen_solut). 
% Различные типы регуляризаторов. Задаются в Main_OPN_OPSF.
%  При расчетах используется сингулярное разложение матрицы дискретизованной задачи
%  (модуль L_reg).

clear all;close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
vvv=ver('MATLAB');nmver=str2num(vvv.Version);if nmver>6;
warning('off','MATLAB:dispatcher:InexactMatch');end

disp(' ');
disp(' Решение интегральных уравнений 1-го рода с помощью алгоритмов ОПН и ОПСФ');
disp(' (с.140).');disp(' ');
disp('   Можно искать различные типы L-псевдорешений, установив тип регуляризатора.');
disp(' ');
disp('-------------------------------------------------------------------');


% Сетки
t=linspace(-1,1,121);ht=t(2)-t(1);n=length(t);%x=t;hx=ht;
LL=3;
x=linspace(-LL,LL,121);hx=x(2)-x(1);m=length(x);
[TT,XX]=meshgrid(t,x);
% Задание операторного уравнения:
p=4;
K1=1./(1+p*(XX-TT).^2);

% Преобразование данных в матричную форму:
Hx=ones(1,m)*hx;Hx(1)=0.5*Hx(1);Hx(end)=Hx(1);
Ht=ones(1,n)*ht;Ht(1)=0.5*Ht(1);Ht(end)=Ht(1);
HHx=repmat(sqrt(Hx)',1,n);HHt=repmat(Ht,m,1);
AA=K1.*HHx.*HHt;% -- матрица системы
%  Модельное решение и модельная правая часть:
zstr='(1-t.^2).^2';z=eval(zstr)';

[uu]=righ_hand(x,p,1);

u0=uu';

%  Преобразованная правая часть:
u1=u0.*sqrt(Hx');% -- правая часть системы

%  Возмущения данных:
delta=0.03;hdelta=0.001;
C=1.1;ster=0;
RN1=randn(m,1);%RN1=2*(rand(n,1)-0.5);
RK1=(randn(size(AA)));%RN1=2*(rand(size(K1))-0.5);
if ster==1;load Error_Comp_L;end
u=u1+delta*norm(u1)*RN1/norm(RN1);
A=AA+hdelta*norm(AA)*RK1/norm(RK1);

disp(' ');disp(['    Ошибки данных: delta = ' num2str(delta) '  h = ' num2str(hdelta)]);
disp(' ');disp(['    Число обусловленности матрицы = ' num2str(cond(A))]);disp(' ');
disp('-------------------------------------------------------------------');
disp('     Нажмите любую клавишу для просмотра данных и списка регуляризаторов!');pause
   
figure(32);plot(x(2:end-2),u1(2:end-2),'r',x(2:end-2),u(2:end-2),'b.');
set(gca,'FontName',FntNm);   
h66=legend('Точная правая часть','Приближ. правая часть',1);
set(h66,'Position',[ 0.589 0.810 0.371 0.087 ]);
set(gcf,'Name','Правые части','NumberTitle','off')
disp(' ');disp('     Типы регуляризаторов:');
disp('  1 - Регуляризатор в L_2');
disp('  2 - Регуляризатор в W_2^1 -- L-псевдорешение с нулевыми гр. условиями');
disp('  3 - Регуляризатор в W_2^1 с условиями dz/dx(a)=dz/dx(b)=0');
disp('  4 - Регуляризатор в W_2^2 -- L-псевдорешение с условиями dz/dx(a)=dz/dx(b)=0');
disp('  5 - Регуляризатор в W_2^1 с условиями dz/dx(a)=dz/dx(b)=0');

disp(' ');Nom=input('    Задайте тип регуляризатора (тип L-псевдорешения) (1 - 5): ');
disp(' ');
disp('-------------------------------------------------------------------');
disp(' ');

%     Задание регуляризатора
if Nom==1;reg=0;% Регуляризатор в L_2
elseif Nom==2;reg=1;% Регуляризатор в W_2^1 -- L-псевдорешение с нулевыми гр. условиями
elseif Nom==3;reg=21;% Регуляризатор в W_2^1 с условиями z'(a)=z'(b)=0
elseif Nom==4;reg=2;% Регуляризатор в W_2^2 -- L-псевдорешение с условиями z'(a)=z'(b)=0
elseif Nom==5;reg=22;% Регуляризатор в W_2^2 с условиями z'(a)=z'(b)=0
else disp(' Неопозранный регуляризатор. Повторите ввод.');return
end

[U,V,sig,X,y,w,sss]=L_reg(reg,A,u,hx,ht);

disp(['          Используемый регуляризатор: ' sss]);
disp(' ');
disp('-------------------------------------------------------------------');
disp(' ');
disp('      Нажмите любую клавишу для выбора параметра alpha по ОПН и ОПСФ! ');
disp(' ');pause
disp('-------------------------------------------------------------------');

% Выбор параметра по ОПН и ОПСФ
q=0.4;NN=25;% Сетка по alpha задается для визуализации обобщ. нев\зки и сглаж. ф-ла

[alf_opn,alf_opsf]=gen_solut(t,A,u,U,V,sig,X,y,w,delta,hdelta,C,q,NN,z);

% Выбор параметра по модификациям ОПН и ОПСФ для нелинейных задач
disp(' ');
disp('      Выбор параметра по модификациям ОПН и ОПСФ для нелинейных задач.');
disp('      Нажмите любую клавишу!');disp(' ');
disp('-------------------------------------------------------------------');
pause

[alf_opn,alf_opsf]=nonlin_choice(t,A,u,U,V,sig,X,y,w,delta,hdelta,C,q,NN,z);

disp(' ');disp('         Конец демонстрации');disp(' ');

