clear;clc;

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
t = 0:99;
xs = 3*sin(t);
figure(1)
subplot(211);
plot(t,xs);grid on;ylabel('幅度');title('it{输入周期性信号}')

%--------------------------------------------------------------------------
%   噪声信号产生
%--------------------------------------------------------------------------
t = 0:99;
xn = 3*sin(0.5*t);
subplot(212)
plot(t,xn);grid on
ylabel('幅度');xlabel('时间');title('it{随机噪声信号}')

%--------------------------------------------------------------------------
%   信号滤波
%--------------------------------------------------------------------------
xn = xs + xn;
xn = xn.';                                                                  %输入信号序列
dn = xs.';                                                                  %预期结果序列
M = 20;                                                                     %滤波器阶数

rho_max = max(eig(xn*xn.'));                                                %输入信号的相关矩阵的最大特征值
mu = (1/rho_max);                                                           %收敛因子0<mu<1/rho
[yn,W,en] = LMS(xn,dn,M,mu);
% [yn,W,en] = lms2(xn,dn,M,mu);

%--------------------------------------------------------------------------
%   可视化
%--------------------------------------------------------------------------
figure(1)
subplot(211)
plot(t,xn);grid on
ylabel('幅度');xlabel('时间');title('滤波器输入信号')
subplot(212)
plot(t,yn);grid on
ylabel('幅度');xlabel('时间');title('自适应滤波器输出信号')

%--------------------------------------------------------------------------
%   绘制自适应滤波器输出信号，预期输出信号和两者的误差
%--------------------------------------------------------------------------
figure(2)
plot(t,yn,'b',t,dn,'g--',t,dn-yn,'r');grid on
legend('自适应滤波器输出','预期输出','误差');
ylabel('幅度');xlabel('时间');title('自适应滤波器')