%      Содержание директории Sect3\Par6 -- демонстрация главы 3 \S6
%                         (МАТЛАБ 5 -- 7)

%  Mon_desc_QP -- Решение интегрального уравнения Фредгольма 1 рода на классе
%                  монотонно не возрастающий функций. Регуляризующий алгоритм ОПК с 
%                  регуляризатором-вариацией. Реализация -- сведение к задаче 
%                  квадратичного программирования (с.170).
% Использует: righ_hand

%  Desc_conv_QP -- Решение интегрального уравнения 1-го рода на классе монотонно не возраст.
%                  и выпуклых (вниз) функций, ограниченных снизу числом C_min (с.173).
% Использует: mod_probl 

% Tikh_conv_QP -- Решение интегрального уравнения Фредгольма 1 рода на классе
%                 выпуклых (вниз) функций. Метод регуляризации Тихонова 0-го порядка.
%                 Выбор параметра по ОПН (с.174).
% Использует: mod_prob2_norm func_calc_QP Tikh_alf_QP tikh_inv_QP

%  Conv_QP -- Решение интегрального уравнения 1-го рода на классе выпуклых (вниз) функций 
%             с ограниченной снизу числом C_min правой производной (с.176).
% Использует: mod_prob2

%  Pereg_QP -- Решение интегрального уравнения 1-го рода на классе функций c монотонной z''(s)
%              (ограниченных снизу числом C_min) (с.176).
% Использует: mod_prob3


