% OMN_demo

% Демонстрация работы ОМН в простейшем случае N=3 (с.126)

clear all;close all;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

disp(' ');disp('      Демонстрация работы ОМН в простейшем случае N=3');disp(' ');

r1=2;r2=1;v1=1;v2=1;v3=0.01;% v3 -- мера несовместности точной системы
RR=diag([r1 r2 0]);vv=[v1 v2]';
del=0.05;h=0.05;mu=v3;C=1.01;
dr=randn(1,2);dv=randn(2,1);v=vv+del*dv/norm(dv);rr=[r1 r2]+h*dr/norm(dr);
R=diag([rr 0]);
x=linspace(-2.5,2.5,201);y=x;[X,Y]=meshgrid(x,y);

% Одна из форм обобщенной невязки
Z=(rr(1)*X-v(1)).^2+(rr(2)*Y-v(2)).^2+v3^2-C*(mu+del+h*sqrt(X.^2+Y.^2)).^2+(C-1)*mu^2;

disp(' ');disp(' Точные данные задачи -- расширенная матрица');
disp('-----------------------------------------------------------');disp(' ');
disp([char(['    ';'    ';'    ']) char(['[';'[';'[']) num2str(RR) char(['|';'|';'|']) num2str([vv;v3]) char([']';']';']'])]);
disp(' ');disp('-----------------------------------------------------------');
disp(' ');disp([' Уровни ошибок: delta = ' num2str(del) '  h = ' num2str(h)]);
disp(' ');disp('                 приближенные данные -- расширенная матрица');disp(' ');
disp('-----------------------------------------------------------');
disp([char(['    ';'    ';'    ']) char(['[';'[';'[']) num2str(R) char(['|';'|';'|']) num2str([v;v3]) char([']';']';']'])]);
disp(' ');
disp('-----------------------------------------------------------');

disp(' ');disp('    Для решения задачи по методу ОМН нажмите любую клавишу!');disp(' ');
pause
figure(1);meshc(X,Y,Z);xlabel('x');ylabel('y');
set(gca,'FontName',FntNm);
title(' Ограничение задачи ОМН -- обобщенная невязка \rho=\rho_{\eta}(x,y) и ее линии уровня')
pause(0.5);
disp(' ');disp('    Графическое представление решения.');disp(' ');
ii=find(Z<=0);[mm,jj]=min(X(ii).^2+Y(ii).^2);dis=sqrt(X(ii).^2+Y(ii).^2);ddd=dis(jj);
xx=X(ii);yy=Y(ii);
disp('-----------------------------------------------------------');
disp(['      Точное решение       = ' num2str([v1/r1 v2/r2])]);
disp(['      Приближенное решение = ' num2str([xx(jj) yy(jj)])]);
disp('-----------------------------------------------------------');disp(' ');
w=[0 0.1 0.5 1 2 ];
figure(2);plot(v1/r1,v2/r2,'.r',xx(jj),yy(jj),'.b',[0 xx(jj)],[0 yy(jj)],'k');
hold on;contour(X,Y,Z,[w w]);xlabel('x');ylabel('y')
plot([0 0],[-2.5 2.5],'k',[-3.16 3.16],[0 0],'k');hold off;axis equal;
set(gca,'FontName',FntNm);
title(' Линии уровня обобщенной невязки (внутренняя линия -- \rho_{\eta}(x,y)=0) и решения');
legend('Точное решение','Приближенное решение',3)

disp(' ');disp('         Конец демонстрации');disp(' ');

