%--------------------------------------------------------------------------
%   带有发射波形的天线方向图通用仿真模板
%   采用matlab 工具箱带有原始波形的天线方向图仿真
%   20210705    刘夏
%--------------------------------------------------------------------------
clear;clc;

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
c = 3e8;                                                                    %光速

%--------------------------------------------------------------------------
%   阵列设置
%--------------------------------------------------------------------------
fd = 2e9;                                                                   %天线阵列设计频率
lambda_d = c/fd;                                                            %天线阵列设计波长
d = lambda_d/2;                                                             %天线阵列设计阵元间距
M = 64;                                                                     %阵元数量
d_array = ((0:M-1).*d);                                                     %阵列排布

%--------------------------------------------------------------------------
%   射频设置
%--------------------------------------------------------------------------
fc = 1060e6;                                                                %天线射频
lambda = c/fc;                                                              %射频波长

%--------------------------------------------------------------------------
%   发射波形设置
%--------------------------------------------------------------------------
fs = 200e6;                                                                 %采样率
bw = 120e6;                                                                 %扫频带宽
tm = 1e-6;                                                                  %扫频时间
waveform = phased.FMCWWaveform('SweepTime',tm,...
                                'SweepBandwidth',bw,...
                                'SampleRate',fs,...
                                'SweepInterval','Symmetric');

nfft = 256;                                                                 %256点fft
freq_step = bw/nfft;                                                        %频率步进
freq_set = ((-bw/2):freq_step:(bw/2)-freq_step)+fc;                         %频率间隔
lambda_set = (c./freq_set).';                                               %波长间隔组

sig = waveform();                                                           %发射波形
sig_freq = fft(sig,nfft,1);                                                 %波形群时延

%--------------------------------------------------------------------------
%   多点频 多波束 导向矢量
%--------------------------------------------------------------------------
beam_angle_d = linspace(-45,45,48);

for idx = 1:numel(beam_angle_d)
    w(:,:,idx) = exp(-1j*2*pi./lambda_set.*d_array.*sind(beam_angle_d(idx)));
end

%--------------------------------------------------------------------------
%   增加64阵taylorwin
%--------------------------------------------------------------------------
w = w.*taylorwin(64).';

%--------------------------------------------------------------------------
%   仿真角度
%--------------------------------------------------------------------------
angle_d = -60:0.1:60;                                                       %仿真角度范围

%--------------------------------------------------------------------------
%   构造回波信号
%--------------------------------------------------------------------------
tic
parfor idx = 1:numel(angle_d)
    disp(['仿真角度 - > ' num2str(angle_d(idx)) '°'])
    A = exp(1j*2*pi./lambda_set.*d_array.*sind(angle_d(idx)));              %计算在不同角度回波信号产生的阵列流形(频域)
    echo_sig_freq = sig_freq.*A;                                            %频域对信号产生群时延
    
    %----------------------------------------------------------------------
    %   频域 导向矢量 多频点 二维*三维点乘
    %----------------------------------------------------------------------
    echo_sig = ifft(echo_sig_freq.*w,nfft,1);
    rx(:,:,idx) = reshape(sum(echo_sig,2),nfft,[]);                         %对64阵列矢量叠加,该角度下 该波束的矢量叠加输出 (时域)
end
toc
%--------------------------------------------------------------------------
%   对不同频点画图
%--------------------------------------------------------------------------
rx_freq = fft(rx,nfft,1);
                       
%--------------------------------------------------------------------------
%   选取一个波束，选取一个频点
%--------------------------------------------------------------------------
beam_idx = 24;
freq_idx = 20;

radiation_pattern = reshape(rx_freq(freq_idx,beam_idx,:),[],1);
radiation_pattern_dB = mag2db(abs(radiation_pattern));
                       
plot(angle_d,radiation_pattern_dB);grid on                        
                       
for beam_idx = 1:1
    freq_idx = 128;

    radiation_pattern = reshape(rx_freq(freq_idx,beam_idx,:),[],1);
    radiation_pattern_dB = mag2db(abs(radiation_pattern));
    radiation_pattern_dB = radiation_pattern_dB-max(radiation_pattern_dB);
    plot(angle_d,radiation_pattern_dB);grid on;hold on
end

                       
                 
                       
                       
                       
                       
                       
                       



