%  MPM_appl

%  Нахождение нормального псевдорешения СЛАУ методом 
%  минимальной псевдообратной матрицы

clear all;close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

disp('*********************************************************************');
disp(' ');
disp('   Нахождение нормального решения СЛАУ методом МПМ и  ');
disp('   оценка ошибки вычисленного таким путем приближенного решения.');
disp('   Демонстрация устойчивости вычисления ранга по методу МПМ.');disp(' ');

disp('      Описание модельных задач: решаются две задачи с матрицами типа Тёплица,');
disp('         у которых занулены NUL штук минимальных сингулярных чисел. Тогда');
disp('         соответствующий оператор имеет размерность нуль-пространства = NUL.');
disp('      Задачи: 1) A=toeplitz([1./(1+([0:N-1].^2))]), N=21 с NUL=8; z=A*A*ones(N,1)');
disp('              2) A=toeplitz([1./(1+([0:N-1]))]), N=21 с NUL=4; z=A*ones(N,1)');
disp(' ');

C=1.1;

%numm=1; % Номер модельной задачи
numm=input('  Задайте номер модельной задачи (1,2): ');
if isempty(numm)|abs((numm-1.5))>1;
    disp('     Номер неверный. Повторите ввод!');return;end
disp(['     Решается задача ' num2str(numm) '. Нажмите любую клавишу!']);disp(' ');
pause

[N,A,u,z,ML,x,t]=model1(numm);

ca=cond(A);rex=num2str(rank(A));

disp(['     Порядок матрицы = ' num2str(N) ' ; число обусловленности = ' num2str(ca)])
disp(['     точный ранг матрицы = ' rex ])

disp(' ');disp('*********************************************************************');
disp(' ');
disp('   Ошибка матрицы     Относит. ошибка решения     Оценки ранга матрицы:');

%  Возмущения данных:
delta=0.001;
for kk=1:5;
H=10^(kk-6);if kk==5;H=0.03;end
%   Возмущения
RA=randn(size(A));AA=A+H*norm(A)*(RA)/norm(RA);
reap=num2str(rank(AA));
RN1=randn(size(u));DD=log10(delta);
u1=u+delta*norm(u)*RN1/norm(RN1);

hh=(C*H*norm(AA))^2;% Оценка величины h^2

[B,B1,IB,IB1,rapr]=mpm_inv(AA,hh);

%  Вычисление приближенных решений
zap=IB*u1;zap1=IB1*u1;

figure(2);plot(x,z,'r',x,zap,'.-',x,zap1,'o-');
set(gca,'FontName',FntNm,'YLim',[0 ML],'XLim',[min(x) max(x)])
hhh=text(2,0.1*ML,' Посмотрите решение и');set(hhh,'FontWeight','bold','FontName',FntNm);
hhh=text(2,0.05*ML,' нажмите любую клавишу!');set(hhh,'FontWeight','bold','FontName',FntNm);
xlabel('k');ylabel('z_k, z^{\alpha}_k');
title('Решение: точное (-),приближенное (о)')

disp(' ');reap=rank(AA);
str1='                                         по МАТЛАБу:  Rank A = ';
str2='; по МПМ:  Rank A =';
disp([str1 num2str(reap) str2 num2str(rapr)])
disp(' ');


Err=norm(z-zap)/norm(z);
format long
disp([H Err]);format short;pause
end
disp(' ');disp('*************** Конец ***********************************************');
