% Fredholm_ord
% Интегральные уравнения Фредгольма 1 рода: применение обычных методов
% и их неустойчивость (с.40 - 41)

clear all
close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ');disp(' ');

disp('------------------------------------------------------------------');
disp(' ')
disp('    Решение интегрального уравнения Фредгольма 1 рода');
disp('    с ядром K(x,t)=1/(1+(x-t)^2)');disp(' ')
disp('    Модельное решение: z=(1-t.^2).^2')

delta=0.001; %- Среднеквадратичная относ. ошибка данных (0.1%)
NN=2;
t=linspace(-1,1,125);x=t;n=length(t);h=t(2)-t(1);[XX,TT]=meshgrid(x,t);
z=(1-t.^2).^2';A=h./(1+(XX-TT).^2);u=A*z;
tt=linspace(-2,2,125);;k1=1./(1+tt.^2);

disp('------------------------------------------------------------------');
disp(' ');disp('Просмотр дискретных данных задачи Az = u');disp(' ')
disp('   Нажмите любую клавишу!');disp(' ');
pause

disp(' ');disp([' Уровень ошибок данных: h = delta = ' num2str(delta)]);
disp('  Неустойчивость применяемых методов отражена в диагностических');
disp('  сообщениях МАТЛАБа. ');
disp('      Результаты зависят от реализаций случайных ошибок данных!');
disp(' ');

figure(1);subplot(2,2,1);plot(t,z,'.-');set(gca,'FontName',FntNm);
title('Точное решение');subplot(2,2,2);plot(tt,k1,'.-');set(gca,'FontName',FntNm);
title('Ядро');subplot(2,2,3);plot(t,u,'.-');set(gca,'FontName',FntNm);
title('Правая часть');
set(gcf,'Name','Данные задачи','NumberTitle','off')

RN1=randn(n,1);ud1=u+delta*RN1/norm(RN1);% Приближенная правая часть
RK1=tril(randn(size(A)));AA=A+delta*RK1/norm(RK1);% Приближенная матрица

disp('------------------------------------------------------------------');
disp(' ');disp('   Для перехода к решению нажмите любую клавишу!');disp(' ');
pause
%    Алгоритм обращения матрицы
disp('------------------------------------------------------------------');
disp(' ')
disp(' 1) Метод обращения оператора: z=A^{-1}u')
disp(' ')
disp(' Нажмите любую клавишу ');disp(' ')

pause

disp(' ')
IAA=inv(AA);IA=inv(A);
zz=IA*u;zzap=IAA*ud1;

figure(2); subplot(2,1,1);
plot(t,z,t(1:NN:end),zz(1:NN:end),'r.- ');
set(gca,'FontName',FntNm); 
title ( 'Решение интегрального уравнения с точными данными' ) ;
legend (' Точное решение ',' Вычисленное решение' , 2) ; 
subplot (2,1,2);
plot (t, zzap, 'r.-',t,z, 'k-')
set(gca,'FontName',FntNm);
legend (' Приближенное решение ' ,' Точное решение ' , 2 ) ;
title ( 'Решение с приближенными данными' );
set(gcf,'Name','Уравнение 1','NumberTitle','off')

%    Алгоритм МНК 
disp('------------------------------------------------------------------');
disp(' ');disp('2) Метод наименьших квадратов: A^TAz=A^Tu ==> z');disp(' ')
disp('   Нажмите любую клавишу!');disp(' ');

pause

%  Вычисление псевдорешения
IA=inv(A'*A)*A';IAA=inv(AA'*AA)*AA';
zz=IA*u;zzap=IAA*ud1;

figure(3); subplot(2,1,1);
plot(t,z,t(1:NN:end),zz(1:NN:end),'r.- ');
set(gca,'FontName',FntNm); 
title ( 'Решение интегрального уравнения с точными данными' ) ;
legend (' Точное решение ',' Вычисленное решение' , 2) ; 
subplot (2,1,2);
plot (t, zzap, 'r.-',t,z, 'k-')
set(gca,'FontName',FntNm);
legend (' Приближенное решение ' ,' Точное решение ' , 2 ) ;
title ( 'Решение с приближенными данными' );
set(gcf,'Name','Уравнение 1','NumberTitle','off')

%    Алгоритм МНК - прямая минимизация
disp('------------------------------------------------------------------');
disp(' ');disp('3) Прямая минимизация невязки СЛАУ: inf{||Az-u||} ==> z');disp(' ')
disp('   Нажмите любую клавишу!');disp(' ');

pause

zz=lsqlin(A,u,[],[]);zzap=lsqlin(AA,ud1,[],[]);

figure(5); subplot(2,1,1);
plot(t,z,t(1:NN:end),zz(1:NN:end),'r.- ');
set(gca,'FontName',FntNm); 
title ( 'Решение интегрального уравнения с точными данными' ) ;
legend (' Точное решение ',' Вычисленное решение' , 2) ; 
subplot (2,1,2);
plot (t, zzap, 'r.-',t,z, 'k-')
set(gca,'FontName',FntNm);
legend (' Приближенное решение ' ,' Точное решение ' , 2 ) ;
title ( 'Решение с приближенными данными' );
set(gcf,'Name','Уравнение 1','NumberTitle','off')

disp('------------------------------------------------------------------');
disp('   Вывод: обычные методы численно неустойчивы при решении некорректных задач.');
disp('------------------------------------------------------------------');
disp('                         Конец демонстрации')

