%  Regress
clear all
close all
% Демонстрация плохой обусловленности матриц метода наименьших квадратов (МНК)
% в задачах приближения экспериментальных кривых многочленами различных степеней.
% (c.39)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ');
disp(' Демонстрация плохой обусловленности матриц метода наименьших квадратов');
disp(' в задачах приближения экспериментальных кривых многочленами (c.39).');
disp(' ');
disp('   Кривая y=exp(-2*x), 0<x<1, приближается многочленами P_n(x)');
disp('   степени n=0,1,...,19 по методу МНК.');
disp('   Символически: P_n(x)=A*a; inf{||P_n(x)-y||^2} ==> a,');
disp('   где x=[x_1 x_2 ... x_j ... x_M]^T, y=exp(-2*x), A=[I x x^2 ... x^n],');
disp('   I=[1 1 ... 1]^T, a=[a_0 a_1 ... a_n]^T -- коэффициенты многочлена.');
disp('   Система уравнений МНК имеет вид: A^T*A*a=A^T*y.');
disp('   Матрица метода A^T*A при M-->\infty "близка" к матрице Гильберта ');
disp('   H_(n+1)=[1/(i+j-1)], i,j=1,2,...,n+1, и поэтому плохо обусловлена.');

M=11;x=linspace(0,1,M)';y=exp(-2*x);
%
delta=0.01;
dy=randn(size(y));ndy=norm(dy);y1=y+delta*norm(y)*dy/ndy;
disp('--------------------------------------------------------------------------');
disp(['     Уровень относительного возмущения данных delta = ' num2str(delta)]);

N=20;A=ones(M,1);
for ij=1:N;A=[A x.^ij];end
%
% P_n(x)=A*a; inf{||P_n(x)-y||^2} ==> a ~ A'*A*a=A'*y
disp('--------------------------------------------------------------------------');

disp(' ');disp(' Плохая обусловленность матрицы МНК проявляется');
disp(' в диагностических сообщениях MATLABa (см. ниже)');disp(' ');
disp('      Для продолжения нажмите любую клавишу!');pause
disp(' ');

for nk=1:N;A1=A(:,1:nk);B=A1'*A1;u=A1'*y1;a=inv(B)*u;
  P(:,nk)=A1*a;Nr(nk)=norm(a);cn(nk)=cond(B);
  nev(nk)=norm(P(:,nk)-y1)/norm(y1);end

disp('--------------------------------------------------------------------------');
disp(' ');
disp('      Для показа графиков нажмите любую клавишу!');pause
disp(' ');

figure(2);subplot(3,1,1);plot([0:N-1],nev,'.-');ylabel('||P_n(x)-y(x)||');
set(gca,'XTick',[],'FontName',FntNm);title('Невязка МНК как функция степени n многочлена')
subplot(3,1,2);plot([0:N-1],Nr,'.-');ylabel('||a||_{ l_2} ');
set(gca,'XTick',[],'FontName',FntNm);title(' Норма коэффициентов многочлена')
subplot(3,1,3);semilogy([0:N-1],cn,'.-');set(gca,'FontName',FntNm);
xlabel('n');ylabel('cond(A^TA)');
title('Число обусловленности матрицы МНК как функция степени многочлена')
figure(1);
for nk=1:N;subplot(4,5,nk);h1=plot(x,y1,'b');hold on;plot(x,P(:,nk),'.r');
  set(gca,'XTick',[],'FontName',FntNm);set(h1,'LineWidth',2);hold off;
  xlabel(['n=' num2str(nk-1)]);
  if nk==N;set(gca,'YLim',[-1 1]);end
end
L=get(gca,'YLim');L1=L(1)-1.5;LL=get(gca,'XLim');L2=LL(1)-6.5;
h88=text(L2,L1,'Приближение кривой y=e^{-2x} (непрерывная линия) многочленами степени n=0,1,... (точки)');
set(h88,'FontName',FntNm,'FontSize',9);
disp('--------------------------------------------------------------------------');
disp('     Вывод: метод МНК применим для аппроксимации кривых многочленами');
disp('     лишь при небольших n; при больших n он неустойчив по отношению ');
disp('     к ошибкам данных и вычислительной ошибке из-за плохой обусловленности');
disp('     матрицы метода.');
disp('--------------------------------------------------------------------------');
disp(' ');