treeList={'竞赛','数学竞赛';'竞赛','英语竞赛';'竞赛','美赛';'竞赛','数模国赛';'竞赛','网络挑战赛';'竞赛','英语翻译';
    '编程','python';'编程','MATLAB';'编程','C#';'编程','C++';'编程','C';'编程','java';'编程','js';'编程','R';'编程','html';
    '编程','php';'编程','rust';'编程','julia';'编程','perl';'编程','carbon';'编程','lisp';
    '技能','office';'技能','LaTeX';'技能','PS';'技能','PR';'技能','excel';'技能','视频剪辑';'技能','bat';
    '基础知识','代数集合';'基础知识','傅里叶';'基础知识','抽代';'基础知识','数分';'基础知识','高代';'基础知识','解几';
    '基础知识','实变';'基础知识','复变';'基础知识','运筹学';'基础知识','泛函';'基础知识','张量分解';'基础知识','概率论';
    '开发工具','eclipse';'开发工具','git';'开发工具','svn';'开发工具','gitee';'开发工具','jupyter';'开发工具','macos';
    '开发工具','postman';'开发工具','vscode';'开发工具','mdnice';'开发工具','pycharm';'开发工具','vim';'开发工具','svn';
    '爱好','国画';'爱好','乒乓球';'爱好','折纸';'爱好','雕刻';'爱好','篮球';'爱好','足球'
    '爱好','唱';'爱好','跳';'爱好','rap';'爱好','背带裤制作';'爱好','理发'};

CT=circleTree2(treeList);
CT=CT.draw();