%      Содержание директории Sect2\Par3 -- демонстрация главы 2 \S3
%                         (МАТЛАБ 5 -- 7)

%  Var_converg0 -- Предварительная демонстрация решения интегрального уравнения 
%                  Фредгольма 1-го рода различными методами.
%    Сравнение качества получаемых приближений в зависимости от гарантируемого типа сходимости.

% 1) Решение задачи без регуляризации путем обращения оператора.
% 2) Алгоритм кусочно-равномерной регуляризации (решение на классе монотонных функций)
% 3) Тихоновская регуляризация 1-го порядка (дает сходимость по вариации и в С)
% 4) Обобщенный метод невязки для функционала обобщенной энтропии - дает сходимость
%    приближений по вариации.

%  Возможны различные режимы работы (см. комментарии в файле Var_converg0).
