%  Paleoterm

%      Решение модельной обратной задачи палеотермометрии проекционным методом (с.274)

clear all
close all

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

disp(' ');disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
disp(' ');
disp('   Решение модельной обратной задачи палеотермометрии проекционным методом (с.274)');
disp(' ');


lcurve=0;% Выбор параметра по L-кривой (да=1/нет=0)
mod_er=0;% Cтандартное (0) или произвольное (1) возмущение

%  Размерность задачи по пространству
N=40;
%  Константы
ga2=6.25e-3;Ga_a=4.12e-3;Ga=0.33;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%      Подготовка к решению обратной задачи

% Находим (вводим) базис решения u_k и решаем прямые задачи 
% с граничным режимом u_k: MU => A_uk
tend=2;
tlist=0.05:0.05:tend;% Экспоненциальный базис
t=tlist;
ht=tlist(2)-tlist(1);
NN=length(tlist);% Размерность по времени
x=linspace(-1,1,N);yy=linspace(0,1,N);y=linspace(0,1,N);
[XX,YY]=meshgrid(x,y);b=(6.25e-3+4.12e-3*YY.^2);

load basis1_2.mat A u_k du_k d2u_k info;
% Базис из гауссианов NN=41 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%   Задаем модельное решение MU и находим (вводим) для него точное переопределение UU

MU=(-4+1.2*exp(-(2-t)/1).*cos(6*pi*sqrt(2-t)/2)).*exp(Ga);
DMU=(1.2*exp(-2+t).*cos(3*pi*(2-t).^(1/2))+...
   1.2*3/2*exp(-2+t).*sin(3*pi*(2-t).^(1/2))*pi/(2-t+eps).^(1/2))*exp(Ga);


load overdet2.mat UU % Переопределение

disp(' ');disp('-----------------------------------------------------------------------');
disp(' ');
disp('     Просмотр данных обратной задачи - температурного разреза в скважине.');
disp(' ');
disp('-----------------------------------------------------------------------');
figure(1);plot((UU).*exp(-Ga*y.^2)+MU(1),yy,'.-');set(gca,'FontName',FntNm);% +MU(1)
title('Температурный разрез в скважине');
xlabel('T^{o} C');ylabel('Относительная высота H/H_0 ледяного купола')
set(gcf,'Name','Данные обратной задачи','NumberTitle','off')

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%  Решаем точную задачу методом псевдообращения:
disp(' ');
disp('   Найдем нерегуляризованное решение в обратной задаче с точными данными.');
disp(' ');
disp('   Для продолжения нажмите любую клавишу!');pause
disp(' ');disp('-----------------------------------------------------------------------');

c=pinv(A)*UU';
%c=A\UU';
z0=u_k*c;UUU=A*c;Residual=norm(UU'-UUU)/norm(UU); 
disp(['     Относ. невязка уравнения (L_2) = ' num2str(Residual)]);disp(' ');
figure(11);subplot (1,2,2);
plot((UU).*exp(-Ga*y.^2)+MU(1),yy,'r',(UUU').*exp(-Ga*y.^2)+MU(1),yy,'b.');
set(gca,'FontName',FntNm);
title('Температурный разрез');xlabel('T^{o} C');ylabel('Относительная высота H/H_0')
legend ('Заданный' ,'Вычисленный' , 3 ) ;
subplot (1,2,1);plot(t-2,z0,'.-',t-2,MU','r');set(gca,'FontName',FntNm);
title('Нерегуляризованное решение задачи \mu(t)');
xlabel('Относительное время t/t_0');ylabel('\mu(t), ^{o}C')
legend ('Calc' ,'Exact' , 1 ) ;
set(gcf,'Name','Нерегуляризованное решение','NumberTitle','off')
disp(' ');
disp('   Для продолжения нажмите любую клавишу!');
disp(' ');pause;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%  Решаем задачу с возмущенными данными методом регуляризации

U=UU';AA=A;delta=0.001;
disp('-----------------------------------------------------------------------');
disp(' ');
disp('   Решаем обратную задачу с возмущенными данными методом регуляризации');
disp(['   Уровень относительной модельной ошибки данных delta=' num2str(delta)]);disp(' ');
disp('   Для продолжения нажмите любую клавишу!');
disp(' ');pause;

RU=randn(size(U));
if mod_er==0;load mod_error001 RU;end
U=U+delta*norm(U)*RU/norm(RU);

tikh_teploterm

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%  Окончательное решение
UUc=A*zr30;
figure(23);subplot (1,2,2);
plot((UU).*exp(-Ga*y.^2)+MU(1),yy,'r',(UUc').*exp(-Ga*y.^2)+MU(1),yy,'b.');
set(gca,'FontName',FntNm);
title('Температурный разрез');xlabel('T^{o} C');ylabel('Относительная высота H/H_0')
legend ('Заданный' ,'Вычисленный' , 3 ) ;
subplot (1,2,1);plot(t(2:end)-2,zr0(2:end), '.-',t(2:end)-2,z(2:end), 'r-');
set(gca,'FontName',FntNm);
title('Регуляризованное решение задачи \mu(t)');
xlabel('Время t/t_0');ylabel('\mu(t), ^{o}C')
legend ('Calc' ,'Exact',2) ;
set(gcf,'Name','Регуляризованное решение','NumberTitle','off')
