%  Inv_flux

%  Решение различными методами обратной задачи стационарного термического контроля 
%  объекта.

%  Математические постановки: G -- область в R^2 (см. vessel_pic1), dG=dG_0+dG_1+dG_2
%    прямая задача -- по заданной на части dG_2 границы температуре T_1 и
%                     заданному на dG_1 тепловому потоку (при условии теплоизоляции dG_0)
%                     найти температуру T в G и тепловой поток U на dG_2.              
%  
%   -div[lambda(T)grad(T)]=0 в G-dG
%    -lambda(T)(dT/dn)|_{dG_1}=z,            ==>  T, U=-lambda(T)(dT/dn)|_{dG_2}
%     T|_{dG_2}=T_1, (dT/dn)|_{dG_0}=0
%
%  Сегменты границы: dG_2=(1)+(2), dG_1=(3)+(4)+(5), dG_0=(6)+(7) -- см. рис.
%
%  lambda(T)=lambda0+eta0*(T-T0), 
%            lambda0=16.5 Вт/(м^2 K^o);eta0=0.0115 Вт/(м^2 (K^o)^2);T0=400 K^o;
%
%    Обратная задача: 
%               по заданной T|_{dG_2}=T_1 и "переопределению" U=-lambda(T)(dT/dn)|_{dG_2}
%               найти z=-lambda(T)(dT/dn)|_{dG_1} (и T в G)
%
%   Переход к безразмерным переменным u,G:
%   T=T0+(sqrt(u)-1)*lambda0/eta0% T, K 
%   z=0.5*k0^2*G*c/eta0% поток, Вт/м^2 

% Операторное уравнение: U -- задано; найти z из U=Аz, где Аz -- процедура вычисления
%                        потока на dG_2 при заданных T|_{dG_2}=T_1 и 
%                        -lambda(T)(dT/dn)|_{dG_1}=z.
%
%   Доказательство неустойчивости обратной задачи и ее решение разными способами.
%

clear all
close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

global a N3 N4 N7 gg u_ext zadan

if ~exist('assempde');disp(' ');
  disp('  ВНИМАНИЕ! Демонстрация прерывается, т.к. на этой ЭВМ');
  disp('  не установлен компонент МАТЛАБа - PDE Toolbox.');return;end


disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
disp(' ');
disp(' Решения обратной задачи для нелинейного стационарного уравнения теплопроводности:')
disp(' нахождение теплового потока на недоступной поверхности тела вращения по измерениям ');
disp(' температуры и теплового потока на его доступной поверхности (c.269)');disp(' ');
disp('   Для просмотра области, образующей тело вращения, частей границы');
disp('   и разбиения на конечные элементы нажмите любую клавишу!');disp(' ');pause
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');


vessel_pic1;
set(gcf,'Name','Область, части границы и конечные элементы','NumberTitle','off');disp(' ');
pause(2);set(gcf,'Visible','off');
%  Выбор модельной задачи
% Нахождение потока из W_1^1 - zadan=1 или нахождение потока из W_1^2 - zadan=2

warning off
disp(' ');
zadan=...
  input(' Выберите модельную задачу: искомый поток из класса W_1^1 (1) или из W_1^2 (2)? ');
if zadan==1;disp(' ');disp('  Решение на классе W_1^1');%break;
elseif zadan==2;disp(' ');disp('  Решение на классе W_1^2');%break;
else disp(' ');disp('  Неверный номер задачи. Повторите ввод (1 или 2)!');
end;%end

disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');

N7=24;N4=8;N3=4;% N7=16 - число неизвестных на внутренней круговой поверхности №7;
% N3, 4 - число неизвестных (на № 3,4)
N=N3+N4+N7-2;
s7=linspace(0,1,N7);s4=linspace(0,1,N4);s3=linspace(0,1,N3);
if zadan==1;% Точные данные - поток: ~ 142040 Вт/м^2
   a0=[5*ones(size(s3(1:end-1))) 5*ones(size(s4(1:end-1))) fliplr(7*sqrt(abs(s7-1))+5) ];
else 
   a0=[5*ones(size(s3(1:end-1))) 5*ones(size(s4(1:end-1))) fliplr(7*(abs(s7-1)).^(3/2)+5) ];
   end
s=[s3(1:end-1) s4(1:end-1)+1 fliplr(3-s7)];
h7=0.5*pi*0.8;h4=0.6;h3=0.4;
sf=[h7*s7 h4*s4(1:end-1)+h7 h3*s3(1:end-1)+h7+h4];u_ext=1.5;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Управляющие параметры
calcul=0;% Не надо находить базис решений
new_er=1;% Выбрать новую помеху (new_er=1) или стандартную (new_er=0)? 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Уровень относительного возмущения данных
delta=0.005;disp(' ');
disp(['   Относительный уровень возмущения данных delta = ' num2str(delta)]);
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%    Предварительные вычисления: сведение задачи к операторному уравнению U=Аz
disp(' ');
tmp_riss=input(' Нужно ли выдавать графики температуры и потока внутри тела? (да-1/нет-0)  ');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
set(gcf,'Visible','on');

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%    Предварительные вычисления: сведение задачи к операторному уравнению U=Аz
disp(' ');
disp(' Идут предварительные вычисления: сведение задачи к операторному уравнению U=Аz');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
pause(1);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if calcul==1;
a=zeros(size(a0));gg=1;% gg=1 ~ u|_{outer} \neq 0
Bg=0*sol1';

A=[];u_k=[];gg=0;% gg=0 ~ u|_{outer} = 0

h4=waitbar(0,' Wait!');
for k=1:N;a=zeros(size(a0));
   waitbar(k/N,h4);
   a(k)=1; 
   u_k=[u_k a'];%Нахождение базиса потока u_k на внутр. поверхности
   A_uk=sol2';A=[A A_uk];% № 6 => № 1
   % Переопределение du/dn|_{outer}=A_uk как реакция на поток а на внутр. поверхности
end
close(h4);
save init_data.mat u_k A Bg
for k=1:N;figure(100);plot(A(:,k));pause;end
else
   %load init_data.mat u_k A Bg   % N7=16
   load init_data.mat u_k A Bg    % N7=24
end % calcul
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Вычисление точного переопределения U=-lambda(T)(dT/dn)|_{dG_2} 
% по данному внутр. потоку == по модельному решению ищем правую часть операторного ур-ния
a=a0;gg=1;s0=[0:0.025:1];ss=[0.5*pi*s0(1:end-1) s0+0.5*pi];
U0=sol2';

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Решение задачи c возмущениями - неустойчивость задачи
% Выбрать новую помеху или стандартную?   
if new_er==1;RU=randn(size(U0));RA=randn(size(A));
else %load er_realization RU RA;  % N7=16
   load er_realization1 RU RA;    % N7=24
end

NRA=norm(RA);NRU=norm(RU);
U=U0+delta*norm(U0)*RU/NRU;% Приближенная правая часть уравнения
deltaA=0.001;
AA=A+deltaA*norm(A)*RA/NRA;% Приближенная матрица задачи

%set(gcf,'Visible','off');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
disp(' ');disp('   Начинаем решение обратной задачи.');
disp(' ');disp('  1) Доказательство неустойчивости задачи -- ее решение без регуляризации');
disp(' ');
disp('       Нажмите любую клавишу!');
disp(' ');pause

c1=AA\(U-Bg);% Коэфициенты разложения
% Вычисление решения обратной задачи
du_inn=u_k*c1;
% Вычисленное переопределение 
UU1=AA*c1+Bg;
Residual=norm(UU1-U)/norm(U);
Error=norm(du_inn'-a0)/norm(a0);
disp(['   Относит. невязка уравнения (L_2) = ' num2str(Residual) '   Относит. ошибка решения (L_2) = ' num2str(Error)]);

figure(102);subplot(1,2,1);plot(sf,fliplr(a0),'r',sf,fliplr(du_inn'),'.-');
set(gca,'FontName',FntNm);
title('Поток на внутр. поверхности')
subplot(1,2,2);plot(ss,U0,'r',ss,UU1,'.');
set(gca,'FontName',FntNm);
title('Поток на внешн. поверхности')
set(gcf,'NumberTitle','off','Name','Нерегуляризованный МНК')

disp(' ');if tmp_riss>0;
disp('   Нажмите любую клавишу, чтобы посмотреть вычисленные распределения');
disp('   температуры и тепловых потоков в теле!');disp(' ');pause
a=du_inn';gg=1;sol3(8);end

% Регуляризация задачи на классе W_2^1

disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
disp(' ');disp('  2) Интерактивное решение методом регуляризации');
if zadan==1;disp('   А.Н.Тихонова на классе W_2^1');
else disp('   А.Н.Тихонова на классе W_2^2');end
disp(' ');
disp(' После приглашения выберите мышью параметр регуляризации по');
disp(' одному из критериев, приведенных на графиках справа!');disp(' ');
disp('       Нажмите любую клавишу!');
pause


disp('    Идут вычисления вспомогательных функций для разных alpha');disp(' ');

tikh_solut_staz_teplo

% Решение на классе монотонных функций
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
disp(' ');disp('   3) Решение на классе монотонных функций');
disp(' ');
disp('         Нажмите любую клавишу!');
disp(' ');pause

T=tril(ones(length(c1)));ccc=lsqnonneg(AA*T,U-Bg-AA*ones(size(c1)));
cm1=T*ccc+1;du_in1=u_k*cm1;UUU1=AA*cm1+Bg;nev_min=norm(U-UUU1)/norm(U);
Error=norm(du_in1'-a0)/norm(a0);
%Var_error_m=Var1(du_in1'-a0)/Var1(a0)
disp(['   Относит. невязка уравнения (L_2) = ' num2str(nev_min) '   Относит. ошибка решения (L_2) = ' num2str(Error)]);


figure(103);subplot(1,2,1);plot(sf,fliplr(a0),'r',sf,fliplr(du_in1'),'.-');
set(gca,'FontName',FntNm);
title('Поток на внутр. поверхности')
subplot(1,2,2);plot(ss,U0,'r',ss,UUU1,'.');
set(gca,'FontName',FntNm);
title('Поток на внешн. поверхности')
set(gcf,'Name','Монотонное решение','NumberTitle','off')

disp(' ');if tmp_riss>0;
disp('   Нажмите любую клавишу, чтобы посмотреть вычисленные распределения');
disp('   температуры и тепловых потоков в теле!');disp(' ');pause
a=cm1';gg=1;sol3(12);end


disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%% Конец %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
