%  Alfa_universal

%  Сравнение различных способов выбора параметра регуляризации
%  1) Выбор по невязке; 2) Выбор по критерию квазиоптимальности;
%  3) Метод L-кривой; 4) Выбор по принципу сглаживающего функционала
%  Выбор наилучшего параметра регуляризации для рассматриваемой задачи с заданным
%  решением.
%  Использование этого параметра задачи с тем же ядром, но с другими 
%  модельными решениями (с.141 - 143).

clear all
close all
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
vvv=ver('MATLAB');nmver=str2num(vvv.Version);if nmver>6;
warning('off','MATLAB:dispatcher:InexactMatch');end

disp(' ');
disp('-------------------------------------------------------------------');
disp(' ');
disp(' Применение 4-х способов нахождения параметра регуляризации для выбранной ');
disp(' задачи (с.133) с известным решением.: 1) Выбор по невязке;');
disp('   2) Выбор по критерию квазиоптимальности; 3) Метод L-кривой;');
disp('   4) Выбор по принципу сглаживающего функционала');
disp(' Отбор наилучшего по точности параметра регуляризации и его использование')
disp(' для задач с тем же ядром, но с другими модельными решениями (с.141 - 143).');
disp(' ');

t=linspace(-1,1,125);x=t;n=length(t);h=t(2)-t(1);del=1/sqrt(3);p=10;
[XX,TT]=meshgrid(x,t);
SS=[];%NRPR=0;

%  Модельное решение для настройки параметра регуляризации
zstr='(1-t.^2).^2';z=eval(zstr)';
%zstr='sign(sin(pi*t)).*sin(pi*t).^2';z=eval(zstr)';
%zstr='sin(pi*t).^2';z=eval(zstr)';

%    Рассматриваемые задачи (нумерация как в книге).

% 2) Уравнение Вольтерра
K13=tril(((XX-TT)).^2*exp(-(XX-TT).^2))*h;s3=svd(K13);SS=[SS s3];%NRPR=NRPR+1;

% 3) Интегральное уравнение задачи продолжения потенциала
K14=h./(1+p*(XX-TT).^2);s4=svd(K14);SS=[SS s4];%NRPR=NRPR+1;

% 4) Интегральное уравнение спектрального анализа
K16=exp(-(XX-TT).^2)*h;s6=svd(K16);SS=[SS s6];%NRPR=NRPR+1;

% 6) Интегральное уравнение механики
%  (нахождение нагрузки тонкого стержня по измеряемому его прогибу)
K11=h*tril((XX+1).*(1-TT))+tril((XX+1).*(1-TT))';s1=svd(K11);SS=[SS s1];%NRPR=NRPR+1; 

% 7) Интегральное уравнение механики
%  (нахождение нагрузки балки по измеряемому ее прогибу)
Kq=-h*tril((XX+1).*(TT-1).*((XX+1).^2+TT.^2-2*TT)/6);
K12=Kq+Kq';s2=svd(K12);SS=[SS s2];%NRPR=NRPR+1;  

% 8) Интегральное уравнение задачи проектирования нагревателя
K15=h./(1+(XX-TT).^2).^(3/2);s5=svd(K15);SS=[SS s5];%NRPR=NRPR+1;

% 9) Обращение преобразования Лапласа - универсальное alfa может не годиться!
K17=exp(-XX.*TT)*h;s7=svd(K17);SS=[SS s7];%NRPR=NRPR+1;

disp('-------------------------------------------------------------------');
disp(' '); 
Nom=input('  Введите номер выбранной задачи (2 - 4, 6 - 9): ');disp(' ');
disp('-------------------------------------------------------------------');

NOM=num2str(Nom);

switch NOM
case '6';K1=K11;case '7';K1=K12;case '2';K1=K13;case '3';K1=K14;case '8';K1=K15;
case '4';K1=K16;case '9';K1=K17;otherwise disp(' ');
  disp('**** Неизвестная задача. Повторите с исправленным номером. ****');return;end 

disp(' ');
disp('    Нажмите любую клавишу и подождите выбора наилучшего alfa!');pause
disp('-------------------------------------------------------------------');


disp(['   Параметр alpha выбирается при решении задачи № ' NOM]);disp(' ');pause(1);

u=K1*z;
C=1.1;
%
delta=0.001;
RN1=randn(n,1);%RN1=2*(rand(n,1)-0.5);
ud1=u+delta*norm(u)*RN1/norm(RN1);
RK1=(randn(size(K1)));%RN1=2*(rand(size(K1))-0.5);
if Nom==3;RK1=tril(RK1);end
KK1=K1+delta*0.1*norm(K1)*RK1/norm(RK1);

% Сравнение разных способов нахождения параметра и выбор из них наилучшего
show_comp=0;% Показать сравнение решений или нет (show_comp=0)
[zre,alfa,sr]=best_alfa(t,KK1,ud1,z,C,delta,h,show_comp);

% Полученное наилучшее решение
figure(24);plot(t,z,'k',t,zre,'.-')
set(gca,'FontName',FntNm);xlabel('t');ylabel('z(t), z^{\alpha}(t)');
text(-0.6,0.25,['\alpha=' num2str(alfa)]);
legend('точное реш.',sr,2)
set(gcf,'Name','Тихоновская регуляризация: лучшее решения','NumberTitle','off')
% Наилучший параметр
disp(' ');
disp('-------------------------------------------------------------------');
disp(' ');
disp(' Наилучший параметр регуляризации для рассматриваемой задачи:')
alfa

disp(' ');
disp('-------------------------------------------------------------------');
disp(' ');
disp(' Использование этого параметра для других задач с тем же ядром.');
disp(' '); 
pp=[1:2:125];
for kk=1:10;
   disp('    Нажмите любую клавишу для решения новой задачи!');pause
   disp('-------------------------------------------------------------------');

   if kk==1;zstr='(1-t.^2)';elseif kk==2;zstr='3*(1-t.^2).^4';elseif kk==3;zstr='t';...
      elseif kk==4;zstr='2*t';elseif kk==5;zstr='1-abs(t)';elseif kk==6;zstr='4*abs(t)';...
      elseif kk==7;zstr='abs(t.*(1-t))';elseif kk==8;zstr='(t.*(1-t)).^2';...
      elseif kk==9;zstr='sign(sin(pi*t)).*sin(pi*t).^2';...
      elseif kk==10;zstr='sin(pi*t).^2';else return; end
z2=eval(zstr)';mz=0.5*(min(z2)+max(z2));
u2=K1*z2;
RN1=randn(n,1);%RN1=2*(rand(n,1)-0.5);
ud2=u2+delta*norm(ud1)*RN1/norm(RN1);
[zan,disan,van]=Tikh_alf1(KK1,ud2,h,delta,alfa);
eran=norm(zan-z2)/norm(z2);zstr=strrep(zstr,'.',' ');
figure(25);plot(t,z2,'k',t,zan,'.-')
set(gca,'FontName',FntNm);xlabel('t');ylabel('z(t), z^{\alpha}(t)');
hte=text(0,mz,['z(t)=' zstr]);
   title(['\alpha=' num2str(alfa) ' Невязка=' num2str(disan) ' Ошибка=' num2str(eran)]);
set(hte,'FontName',FntNm);legend('точное реш.','прибл. реш.',2)
set(gcf,'Name','Фиксированный параметр регуляризации','NumberTitle','off')
figure(27);subplot(3,4,kk);plot(t,z2,'r',t(pp),zan(pp),'.');title(zstr);
set(gca,'XTickLabel',[ ]);set(gcf,'Visible','off')
figure(30);subplot(3,4,kk);plot(t,u,'r',t(pp),u2(pp),'.');
set(gca,'FontName',FntNm);title(['Пр. часть №' num2str(kk)]);
set(gca,'XTickLabel',[ ]);set(gcf,'Visible','off')
end  

figure(30);
set(gcf,'Visible','on','Name',['Все правые части u(x) задачи ' NOM],'NumberTitle','off');
%hl=legend(' u(x), использованная для подбора \alpha',' u(x) для текущего решения');
%set(hl,'Position',[ 0.555 0.230 0.4 0.089]);%,'FontSize',8);
subplot(3,2,6);
set(gca,'Position',[0.53 0.2 0.47 0.11],'Box','on','FontSize',8)
plot([0.1 0.25],[0.25 0.25],'r',[0.1 0.25],[0.75 0.75],'b.');
set(gca,'XLim',[-0.25 5],'XTick',[],'YTick',[])
hh=text(0.4,0.75,' u(x) для текущего решения');set(hh,'FontName',FntNm);
hh=text(0.4,0.25,' u(x), использованная для подбора \alpha');set(hh,'FontName',FntNm);
figure(27);
set(gcf,'Visible','on','Name',['Все решения задачи ' NOM ' для разных u(x)'],'NumberTitle','off');
hl=legend('Текущее точн. решение',' Текущее прибл. решение ');
set(hl,'Position',[ 0.555 0.230 0.351 0.089],'FontName',FntNm);

disp(' ');disp(' Просмотр сингулярных чисел задачи.');
disp(' '); disp('    Нажмите любую клавишу!');pause
disp('-------------------------------------------------------------------');


warning off;figure(26);plot(log10(SS),'.-');
set(gca,'FontName',FntNm);title('Сингулярные числа задач');
legend('Задача 2','Задача 3','Задача 4','Задача 6','Задача 7','Задача 8','Задача 9',4)
warning on;
disp(' ');disp('%%%%%%%%%%%%%%%%%%%%%% Конец %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%');
