%--------------------------------------------------------------------------
%   用全局优化搜索最优解
%   用局部最优搜索发现不是最优，因此最小二乘法肯定是失效的
%--------------------------------------------------------------------------
clear;clc;close all

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
fs = 400e6;
waveform = phased.FMCWWaveform('SampleRate',fs,...
                              'SweepBandwidth',400e6,...                    %这里扫频带宽最好占用整个频段，才可以识别各个频点
                              'SweepTime',1e-6,...
                              'SweepInterval','Symmetric');

sig = waveform();


%--------------------------------------------------------------------------
%   做一个滤波器
%--------------------------------------------------------------------------
LP_cali=LP_P90_S100_N101;                                                   %需要进行系统辨识的通道
w = LP_cali.Numerator;                                                      %该真实系统的系数
sig_cali = conv(w,sig);                                                     %矫正通道的输出


%--------------------------------------------------------------------------
%   构造代价函数
%   这里没有考虑相位的延迟，直接对齐的
%--------------------------------------------------------------------------
f = @(x)cost_function(x,sig,sig_cali);

%--------------------------------------------------------------------------
%   pso搜索
%--------------------------------------------------------------------------
[output_w,cost_value] = particleswarm(f,51,-ones(51,1),ones(51,1));

output_w = output_w(:);
output_w = [flipud(output_w(2:end));output_w];                              %重新拼成滤波器
sig_output = conv(output_w,sig);

figure(1);
subplot(131);spectrogram(sig,64,63,64,fs,'yaxis');title('原始')
subplot(132);spectrogram(sig_cali,64,63,64,fs,'yaxis');title('待校准')
subplot(133);spectrogram(sig_output,64,63,64,fs,'yaxis');title('校准后')
figure(2)
plot(w);hold on;plot(output_w,'--x');hold off;grid on;legend('原始滤波器','计算得到滤波器')