%  Nonsat_teplo

% Сравнение точности обычных методов (в спектральной форме) и метода без
% насыщения (специального метода регуляризации Тихонова). Используются:
% 1) простой метод Тихонова; 2) специальный метод регуляризации Тихонова
% Вычисления ведутся для параметра регуляризации, выбранного по ОПН и 
% оптимального параметра в L_2. 
%    Решается одномерная обратная задача (ретроспективная) теплопроводности
%   

clear all;close all

global meth

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

srrr=char(['простой метод Тихонова' 
          'итерир. метод Тихонова' 
          '  метод установления  ' 
          '  метод без насыщения ']);
disp(' '); 
disp('  Решается одномерная обратная (ретроспективная) задача теплопроводности.');
disp(' ');
disp('  Сравнение точности обычных методов (в спектральной форме) и метода без');
disp('  насыщения (специального метода регуляризации Тихонова). Используются:');
disp('  1) простой метод Тихонова; 2) итерированный метод Тихонова (m=2);');
disp('  3) метод установления; 4) специальный метод регуляризации Тихонова.');
disp(' ');
disp('  Вычисления ведутся для параметра регуляризации, выбранного по ОПН и ');
disp('  оптимального параметра в L_2 (с.213).      ');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');
disp('    для начала вычислений нажмите Ввод!');
pause
% Сетки
N=121;
s=linspace(-1,1,N);ht=s(2)-s(1);n=length(s);%x=t;hx=ht;
x=linspace(-1,1,N);hx=x(2)-x(1);m=length(x);
[TT,XX]=meshgrid(s,x);
tau=0.0005;tta=0.001;aa=4*(tta-tau);K1=exp(-(TT-XX).^2/aa)/sqrt(pi*aa);
%K0=XX.*(1-TT);DD=diag(diag(K0));D1=triu(K0);K1=D1+D1'-DD;

%  Модельные данные:
AA=K1*ht;AA(:,1)=0.5*AA(:,1);AA(:,end)=0.5*AA(:,end);
vv=0.5*(-sign(s'-0.2)+sign(s'+0.2));z=AA*vv;
u0=AA*z;


%  Возмущения данных:
delta=0.1;
C=1.1;ster=1;
RN1=randn(size(u0));
RK1=(randn(size(AA)));
if ster==1;load Error_Comp0;end
u=u0+delta*norm(u0)*RN1/norm(RN1);hdelta=0.0001;
A=AA+hdelta*norm(AA)*RK1/norm(RK1);

figure(41);plot(x,u0,'r',x,u,'.');set(gca,'FontName',FntNm);
xlabel('x');title(' Точные и приближенные данные')
set(gcf,'Name','Точные и приближенные данные','NumberTitle','off');pause(1)

disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');
disp(' ');disp(['          Уровень ошибки правой части: delta = ' num2str(100*delta) '% ']);
disp(' ');disp('   Оптимальный выбор параметра делается по минимальной ошибке решения в L_2');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');
reg=0;

[IL,U,V,sig,X,y,w,sss]=L_reg_0(reg,A,u,hx,ht);

q=0.9;NN=35;% Сетка по alpha 

ZSS=[];
for me=[1 4];meth=me;
  disp(' ');disp(['     Используется: ' srrr(meth,:) ' (' num2str(meth) ')']);
  [alf_opn,ZS]=gen_PN_teplo(s,A,u,U,V,sig,IL,X,y,w,delta,hdelta,C,q,NN,z);
ZSS=[ZSS ZS];end
%figure(76);plot(s,z,s,ZSS(:,1),'.r');figure(77);plot(s,z,s,ZSS(:,2),'.r')
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% Конец %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');



