%  Nonsatur

% Сравнение точности обычных методов (в спектральной форме) и метода без
% насыщения (специального метода регуляризации Тихонова). Используются:
% 1) простой метод Тихонова; 2) итерированный метод Тихонова (m=2);
% 3) метод установления; 4) специальный метод регуляризации Тихонова
% Вычисления ведутся для параметра регуляризации, выбранного по ОПН и 
% оптимального параметра в L_2 (с.210). 
%   

clear all;close all

global meth

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
FntNm='Arial Cyr';
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

srrr=char(['простой метод Тихонова' 
          'итерир. метод Тихонова' 
          '  метод установления  ' 
          '  метод без насыщения ']);
disp(' ');      
disp('  Сравнение точности обычных методов (в спектральной форме) и метода без');
disp('  насыщения (специального метода регуляризации Тихонова). Используются:');
disp('  1) простой метод Тихонова; 2) итерированный метод Тихонова (m=2);');
disp('  3) метод установления; 4) специальный метод регуляризации Тихонова');
disp('  Вычисления ведутся для параметра регуляризации, выбранного по ОПН и ');
disp('  оптимального параметра в L_2 (с.210).      ');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');
disp('    для начала вычислений нажмите Ввод!');pause
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');

% Сетки
N=121;
s=linspace(0,1,N);ht=s(2)-s(1);n=length(s);%x=t;hx=ht;
x=linspace(0,1,N);hx=x(2)-x(1);m=length(x);
[TT,XX]=meshgrid(s,x);
K0=XX.*(1-TT);DD=diag(diag(K0));D1=triu(K0);K1=D1+D1'-DD;

%  Модельные данные:
z=sin(4*pi*s');
u0=z/16/pi/pi;
AA=K1*ht;AA(:,1)=0.5*AA(:,1);AA(:,end)=0.5*AA(:,end);

%  Возмущения данных:
delta=0.1;
C=1.1;ster=1;
RN1=randn(size(u0));
RK1=(randn(size(AA)));
if ster==1;load Error_Comp;end
u=u0+delta*norm(u0)*RN1/norm(RN1);hdelta=0.0001;
A=AA+hdelta*norm(AA)*RK1/norm(RK1);

figure(41);plot(x,u0,'r',x,u,'.');set(gca,'FontName',FntNm);
xlabel('x');title(' Точные и приближенные данные')
set(gcf,'Name','Точные и приближенные данные','NumberTitle','off');pause(1)

disp(' ');disp(['          Уровень ошибки правой части: delta = ' num2str(100*delta) '% ']);
disp(' ');disp('   Оптимальный выбор параметра делается по минимальной ошибке решения в L_2');
disp(' ');
disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');
reg=0;

[IL,U,V,sig,X,y,w,sss]=L_reg_0(reg,A,u,hx,ht);

q=0.5;NN=40;% Сетка по alpha 

for me=1:4;meth=me;
  disp(' ');disp(['     Используется: ' srrr(meth,:) ' (' num2str(meth) ')']);
  [alf_opn]=gen_PN(s,A,u,U,V,sig,IL,X,y,w,delta,hdelta,C,q,NN,z);end

disp('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% Конец %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ');



