%% =================================================================
% demo1_1:基础使用，Y为矩阵
X=1:5;
Y=randn(100,5);

figure
violinChart(gca,X,Y,[0 0.447 0.741],0.6);

%% =================================================================
% demo1_2:基础使用，Y为向量，X为标签
X=[1.*ones(1,50),2.*ones(1,30),3.*ones(1,20),4.*ones(1,50),5.*ones(1,50)];
Y=randn(1,200)+sin(X);

figure
violinChart(gca,X,Y,[0 0.447 0.741]);


%% =================================================================
% demo1_3:基础使用多个图像绘制，并添加图例
X1=[1:2:7,13];
Y1=randn(100,5)+sin(X1);
X2=2:2:10;
Y2=randn(100,5)+cos(X2);

figure
Hdl1=violinChart(gca,X1,Y1,[0     0.447 0.741]);
Hdl2=violinChart(gca,X2,Y2,[0.850 0.325 0.098]);
legend([Hdl1.F_legend,Hdl2.F_legend],{'randn+sin(x)','randn+cos(x)'});


