%--------------------------------------------------------------------------
%   自适应通道均衡法
%   参考论文：DBF系统中的通道校准技术研究
%--------------------------------------------------------------------------
%   刘夏 20210531
%--------------------------------------------------------------------------
clear;clc;

fs = 400e6;
data = dlmread('RECV左阵_中心频率1090_内校准_20210513_142825_1090MHz.xls');
data = data(:,4:end,:);
adc_data = complex(data(1:64,1:2:end,:),data(1:64,2:2:end,:));
adc_data = adc_data.';

analysis_data = adc_data(205:205+200-1,:);
freq_data = fft(analysis_data,256,1);
%--------------------------------------------------------------------------
%   选取83点拼接
%--------------------------------------------------------------------------
line_freq = [freq_data(end-83:end,:);freq_data(1:83,:)];
line_freq = freq_data(1:83,:);
figure(1)
plot(abs(line_freq))
figure(2)
plot(unwrap(angle(line_freq(:,1))))