%      Содержание директории Sect3\Par4 -- демонстрация главы 3 \S4
%                         (МАТЛАБ 5 -- 7)

%  Inv_potenz -- Решение обратной задачи гравиметрии -- нелинейного операторного уравнения.
%                Выбор параметра alpha по нелинейному ОПН с помощью предвычисленных
%                вспомогательных функций. Далее, условная (с ограничением z>=H) минимизация 
%                тихоновского функционала (см.с.157). Можно задать безусловную минимизацию.
%                
%  Вспомогательные модули:  graf_choi invpot3  invpot  

%  Inv_potenz_OMN -- Решение обратной задачи гравиметрии с помощью ОМН
%      Минимизация невязки нелинейного операторного уравнения при ограничениях ||z||<C
%      (для сетки значений С) (с.158).
%
%  Вспомогательные модули: invpotomn  omn_con  invpot  omn_constr_final
