%--------------------------------------------------------------------------
%   零陷加深扩张矩阵
%--------------------------------------------------------------------------
%   Mailloux算法扩张矩阵T(线阵)
%   beta            扩展宽度 degree
%   K               虚拟干扰源
%   m行
%   n列
%--------------------------------------------------------------------------
%   example:
%   Rx = Rx.*T_mailoux(0.5,10,N,N);
%--------------------------------------------------------------------------
function T = T_mailoux(beta,K,m,n)
for mdx = 1:m
    for ndx = 1:n
        delta_mn = (mdx-ndx)*pi*deg2rad(beta)/2;
        if mdx == ndx
            T(mdx,ndx) = K;
        else
            T(mdx,ndx) = sin(K*delta_mn)/sin(delta_mn);
        end
    end
end
end