%      Содержание директории Sect5\Par2 -- демонстрация главы 5 \S2
%

% Int_ur_Volterra -- Решение интегральных уравнений Вольтерра 1 рода методом
%  псевдообращения матрицы дискретизированной задачи -- неустойчивый метод. 
%  Анализ типа некоректности для рассматриваемых интегральных уравнений Вольтерра 1 рода
%  (с.248).

% Int_ur_Fredholm -- Решение интегральных уравнений Фредгольма 1 рода методом
%  псевдообращения матрицы дискретизированной задачи -- неустойчивый метод. 
%  Анализ типа некоректности для рассматриваемых интегральных уравнений Фредгольма 1 рода
%  (с.248)

% Test_reg -- Интерактивная демонстрация тихоновской регуляризации в пространстве W_2^1
%  для задач nr1 - nr5 (с.248). Описание задач -- см. с.133.
%  Используется: tikh_alf

% Reconstr_four -- Реконструкция изображения с помощью Тихоновского алгоритма в пространствах
%  Соболева и Лебега. Реализация: преобразование Фурье + проектирование на конус 
%  неотрицательных функций (с.250). Параметр регуляризации -- предвычислен.
%  Используется:  tikhpls  ext2d  conv2d

% Heat_design -- Решение простейшей обратной задачи проектирования нагревателя для 
% технологических целей (с.261).
%  Используется:  inp_data  direct_hd  omega_hd  nev_hd  heat_desgn

%  Heat_design_Tikh -- Решение нелинейного интегрального уравнения проектирования 
%  нагревателя для gamma=1/2 методом регуляризации (с.263). Интерактивный
%  выбор параметра alpha.
%  Используется:  inp_data  tikh_heatdesgn nev_hd  heat_desgn



