%--------------------------------------------------------------------------
%   仿真DDC 1/2抽取数字下变频
%   600Mhz模拟信号通过800MhzAD实信号采样 然后进行1/4fs的IQ正交,然后进行1/2
%   抽取进行频谱搬移
%   20210224 刘夏
%--------------------------------------------------------------------------
%   初始化
%--------------------------------------------------------------------------
clear;clc;

%--------------------------------------------------------------------------
%   仿真一个1600Ghz的信号来构造个模拟信号,为了表示信号方向 采用线性调频
%   模式进行仿真
%--------------------------------------------------------------------------
f_analog = 2.4e9;                                                           %模拟信号频率

%--------------------------------------------------------------------------
%   以1.6Ghz表达一个470Mhz~730Mhz 持续时间1e-5的扫频信号
%   信号实际上是从-130Mhz扫描到130Mhz范围
%--------------------------------------------------------------------------
waveform = phased.FMCWWaveform('SampleRate',f_analog,...
                              'SweepBandwidth',260e6,...
                              'SweepTime',1e-6,...
                              'SweepInterval','Symmetric');
                          
                          
sig = waveform().*rt.exp_wave(1e-6,600e6,f_analog);                         %复信号
sig_r = real(sig);                                                          %实信号

%--------------------------------------------------------------------------
%   模拟ad 用800Mhz采样一个模拟信号
%--------------------------------------------------------------------------
fs = 800e6;
N = f_analog/fs;
sig_ad_in = downsample(sig_r,N);

%--------------------------------------------------------------------------
%   1/4iq正交,搬移200Mhz
%--------------------------------------------------------------------------
[I,Q] = rt.iq_data(numel(sig_ad_in));
sig_iq = sig_ad_in.*I+1j.*sig_ad_in.*Q;

%--------------------------------------------------------------------------
%   用滤波器处理平滑
%   设计了一个260Mhz通300Mhz阻的低通滤波器,压制60dB
%--------------------------------------------------------------------------
load LP_filter.mat
sig_filter = filtfilt(LP_filter,sig_iq);

%--------------------------------------------------------------------------
%   1/2抽取
%--------------------------------------------------------------------------
sig_ad_out = downsample(sig_filter,2);

%--------------------------------------------------------------------------
%   可视化
%--------------------------------------------------------------------------
figure(1)
subplot(231);rt.p3(sig);title('构造470Mhz-730Mhz 复信号@2.4Ghz 模拟')
subplot(232);rt.p3(sig_r);title('构造470Mhz-730Mhz 实信号@2.4Ghz 模拟')
subplot(233);rt.p3(sig_ad_in);title('ad 800Mhz采样470Mhz-730Mhz实信号@800Mhz 数字')
subplot(234);rt.p3(sig_iq);title('AD内部 800Mhz信号进行iq 数字')
subplot(235);rt.p3(sig_filter);title('AD内部 低通滤波器 130Mhz通 200Mhz阻 压制60dB 数字')
subplot(236);rt.p3(sig_ad_out);title('1/2抽取 ad输出复信号@400Mhz 数字')


figure(2)
subplot(231);spectrogram(sig,64,63,64,f_analog,'yaxis');title('构造470Mhz-730Mhz 复信号@2.4Ghz 模拟')
subplot(232);spectrogram(sig_r,64,63,64,f_analog,'yaxis');title('构造470Mhz-730Mhz 实信号@2.4Ghz 模拟')
subplot(233);spectrogram(sig_ad_in,64,63,64,fs,'yaxis');title('ad 800Mhz采样470Mhz-730Mhz实信号@800Mhz 数字')
subplot(234);spectrogram(sig_iq,64,63,64,fs,'yaxis');title('AD内部 800Mhz信号进行iq 数字')
subplot(235);spectrogram(sig_filter,64,63,64,fs,'yaxis');title('AD内部 低通滤波器 130Mhz通 200Mhz阻 压制60dB 数字')
subplot(236);spectrogram(sig_ad_out,64,63,64,fs/2,'yaxis');title('1/2抽取 ad输出复信号@400Mhz 数字')

figure(3)
rt.p3(waveform());title('原始-130Mhz-130Mhz 复信号@2.4Ghz 模拟')


